### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.instance: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNWMyYTYyNy05NTRiLTQ2MmEtYWI1NC04ZDM3N2RkZDNlMDM7b2JqZWN0SWQ9MWZjNWI5ZTgtZDljMy00MTc5LThiNmItNDkxZjE4MDFlMDFhO3N1YnNjcmlwdGlvbklkPWM1N2MyYTAyLTI5N2QtNGY2OC05NzliLTE5NjBkZjcyMjYyNzt0ZW5hbnRJZD1lNjdjMTU4OS00NzQ3LTRiNzMtYjdiYi1kYTFiNTY3ZWUxZjU=]
azurerm_container_group.jaeger: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.ContainerInstance/containerGroups/onlinestore-containergroup-jaeger]
azurerm_service_plan.windows: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan-windows]
azurerm_windows_web_app.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website]
azurerm_windows_web_app.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_container_group.jaeger will be destroyed
  # (because azurerm_container_group.jaeger is not in configuration)
  - resource "azurerm_container_group" "jaeger" {
      - dns_name_label              = "onlinestore-prod-jaeger" -> null
      - dns_name_label_reuse_policy = "Unsecure" -> null
      - exposed_port                = [
          - {
              - port     = 16686
              - protocol = "TCP"
            },
          - {
              - port     = 4317
              - protocol = "TCP"
            },
        ] -> null
      - fqdn                        = "onlinestore-prod-jaeger.eastus.azurecontainer.io" -> null
      - id                          = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.ContainerInstance/containerGroups/onlinestore-containergroup-jaeger" -> null
      - ip_address                  = "20.237.62.197" -> null
      - ip_address_type             = "Public" -> null
      - location                    = "eastus" -> null
      - name                        = "onlinestore-containergroup-jaeger" -> null
      - os_type                     = "Linux" -> null
      - resource_group_name         = "onlinestore-prod-rg" -> null
      - restart_policy              = "Always" -> null
      - subnet_ids                  = [] -> null
      - tags                        = {
          - "environment" = "prod"
        } -> null
      - zones                       = [] -> null

      - container {
          - commands                     = [] -> null
          - cpu                          = 0.05 -> null
          - cpu_limit                    = 0 -> null
          - environment_variables        = {
              - "COLLECTOR_OTLP_ENABLED"     = "true"
              - "COLLECTOR_ZIPKIN_HOST_PORT" = ":9411"
            } -> null
          - image                        = "onlinestorecontainerregistry.azurecr.io/jaegertracing/all-in-one:1.42" -> null
          - memory                       = 0.2 -> null
          - memory_limit                 = 0 -> null
          - name                         = "jaegertracing-all-in-one" -> null
          - secure_environment_variables = (sensitive value)

          - ports {
              - port     = 16686 -> null
              - protocol = "TCP" -> null
            }
          - ports {
              - port     = 4317 -> null
              - protocol = "TCP" -> null
            }
        }

      - image_registry_credential {
          - password                  = (sensitive value)
          - server                    = "onlinestorecontainerregistry.azurecr.io" -> null
          - user_assigned_identity_id = "" -> null
          - username                  = (sensitive value) -> null
        }
    }

  # azurerm_container_group.monitoring will be created
  + resource "azurerm_container_group" "monitoring" {
      + dns_name_label              = "onlinestore-prod-monitoring"
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "eastus"
      + name                        = "onlinestore-containergroup-monitoring"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "onlinestore-prod-rg"
      + restart_policy              = "Always"
      + tags                        = {
          + "environment" = "prod"
        }

      + container {
          + commands              = (known after apply)
          + cpu                   = 0.05
          + environment_variables = {
              + "COLLECTOR_OTLP_ENABLED"     = "true"
              + "COLLECTOR_ZIPKIN_HOST_PORT" = ":9411"
            }
          + image                 = "onlinestorecontainerregistry.azurecr.io/jaegertracing/all-in-one:1.42"
          + memory                = 0.2
          + name                  = "jaegertracing-all-in-one"

          + ports {
              + port     = 16686
              + protocol = "TCP"
            }
          + ports {
              + port     = 4317
              + protocol = "TCP"
            }
        }

      + image_registry_credential {
          + password = (sensitive value)
          + server   = "onlinestorecontainerregistry.azurecr.io"
          + username = (sensitive value)
        }
    }

  # azurerm_windows_web_app.api will be updated in-place
  ~ resource "azurerm_windows_web_app" "api" {
      ~ app_settings                      = {
          - "OTLPEXPORTER__ENDPOINT" = "http://onlinestore-prod-jaeger.eastus.azurecontainer.io:4317"
        } -> (known after apply)
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api"
        name                              = "os-onlinestore-prod-api"
        tags                              = {}
        # (17 unchanged attributes hidden)

      ~ site_config {
            # (23 unchanged attributes hidden)

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_web_app.website will be updated in-place
  ~ resource "azurerm_windows_web_app" "website" {
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website"
        name                              = "os-onlinestore-prod-website"
        tags                              = {}
        # (18 unchanged attributes hidden)

      ~ site_config {
            # (23 unchanged attributes hidden)

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  - container_instance_jaeger_fqdn     = "onlinestore-prod-jaeger.eastus.azurecontainer.io" -> null
  + container_instance_monitoring_fqdn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Instance - plan prod`*